; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=40, remove_proportion=0.101, bases=16, instance_id=11, output=./training, seed=52

(define (problem warehouse-11)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 - base
    )
    (:init
        (to-remove box4)
        (to-remove box18)
        (to-remove box31)
        (to-remove box33)
        (clear box14)
        (on box14 box10)
        (on-base box10 base1)
        (clear box11)
        (on box11 box26)
        (on box26 box3)
        (on-base box3 base2)
        (clear box36)
        (on box36 box28)
        (on box28 box16)
        (on-base box16 base3)
        (clear box25)
        (on-base box25 base4)
        (clear box32)
        (on box32 box4)
        (on box4 box31)
        (on-base box31 base5)
        (clear box18)
        (on box18 box17)
        (on box17 box34)
        (on box34 box38)
        (on box38 box5)
        (on box5 box7)
        (on-base box7 base6)
        (clear-base base7)
        (clear box20)
        (on box20 box15)
        (on-base box15 base8)
        (clear box21)
        (on box21 box35)
        (on-base box35 base9)
        (clear-base base10)
        (clear box37)
        (on-base box37 base11)
        (clear box30)
        (on box30 box8)
        (on box8 box1)
        (on-base box1 base12)
        (clear box27)
        (on box27 box33)
        (on box33 box29)
        (on box29 box12)
        (on-base box12 base13)
        (clear box39)
        (on box39 box2)
        (on box2 box24)
        (on box24 box40)
        (on box40 box6)
        (on-base box6 base14)
        (clear box9)
        (on box9 box13)
        (on-base box13 base15)
        (clear box22)
        (on box22 box19)
        (on box19 box23)
        (on-base box23 base16)
    )
    (:goal (and 
        (removed box4)
        (removed box18)
        (removed box31)
        (removed box33)
    ))
)

; plan
1. (move box27 box33 box11)
   deleted: (clear box11) (on box27 box33)
   added: (on box27 box11) (clear box33)
   goals met: 0 of 4
2. (move box32 box4 box14)
   deleted: (clear box14) (on box32 box4)
   added: (on box32 box14) (clear box4)
   goals met: 0 of 4
3. (remove box18 box17)
   deleted: (on box18 box17) (clear box18)
   added: (removed box18) (clear box17)
   goals met: 1 of 4
4. (remove box33 box29)
   deleted: (on box33 box29) (clear box33)
   added: (removed box33) (clear box29)
   goals met: 2 of 4
5. (remove box4 box31)
   deleted: (on box4 box31) (clear box4)
   added: (removed box4) (clear box31)
   goals met: 3 of 4
6. (remove-from-base box31 base5)
   deleted: (on-base box31 base5) (clear box31)
   added: (removed box31) (clear-base base5)
   goals met: 4 of 4
